#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/diogoleal/crispy-succotash/runs/run-c5SGCPdDB18ZsPHQ

Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-05599f1b888bf0202]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-04435c30adf5c869f]
aws_kms_key.this: Refreshing state... [id=c0121f0c-7369-442f-86b7-8584c7cf55b4]
aws_placement_group.web: Refreshing state... [id=k8s]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b1eceb434b1ee209]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0d23ef779fbaabe66]
aws_ebs_volume.this[1]: Refreshing state... [id=vol-0aef6998d35835dd8]
aws_ebs_volume.this[2]: Refreshing state... [id=vol-0eab6b2eb47d66fb4]
aws_ebs_volume.this[0]: Refreshing state... [id=vol-096ba94a2417a038f]
aws_ebs_volume.isto: Refreshing state... [id=vol-0205533094a6ed180]
module.rancher_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b29ea191a871c068]
module.zones.aws_route53_zone.this["comics.internal"]: Refreshing state... [id=Z01781481HFGDU1GUYUVQ]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0e7a69e8406ff7666]
module.zones.aws_route53_zone.this["private-vpc.comics.internal"]: Refreshing state... [id=Z0287456Q6TVW5THXL4I]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e3e512cc196dc9cd]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0672b2e345abe128e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09f1990a664fda268]
module.zones.aws_route53_zone.this["app.comics.internal"]: Refreshing state... [id=Z0613456248X9BR5PAUWH]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0870377308accc34a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0baabeb14d663cce9]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a25bf93ee5ee6587]
module.k8s_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-091e42ffb05cdce5c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c7bf67e380d57118]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0501802ba38bd6a5b]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-054e665b7db360f7f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-036057ff548d4d461]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01378cfdbff904320]
module.rancher_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1790403260]
module.rancher_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2010644737]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-015128f9c2a716890]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0874965bb464bb0dc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-014823efd1d9609be]
module.rancher_instance.aws_instance.this[0]: Refreshing state... [id=i-0a387ecc85e2bc626]
module.k8s_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1730324709]
module.k8s_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1783682451]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f22ae2d5cb06ec9b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d8e21a2ef672f569]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d66f34cd611ca696]
aws_network_interface.this: Refreshing state... [id=eni-0bd33ba9dd7a665ea]
module.k8s_instance[1].aws_instance.this[0]: Refreshing state... [id=i-0f3b50f766112339e]
module.k8s_instance[2].aws_instance.this[0]: Refreshing state... [id=i-0d3560b289d1342f9]
module.k8s_instance[0].aws_instance.this[0]: Refreshing state... [id=i-051471ca2e333798e]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01378cfdbff9043201080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00d6e0f104c2e7c33]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-096b91ab6b9d9f546]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00b37f38372d7d1f6]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0baabeb14d663cce91080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a25bf93ee5ee65871080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0870377308accc34a1080289494]
aws_volume_attachment.this[0]: Refreshing state... [id=vai-2876505751]
aws_volume_attachment.this[1]: Refreshing state... [id=vai-1792568346]
aws_volume_attachment.this[2]: Refreshing state... [id=vai-3051708014]
module.records.aws_route53_record.this["rancher.comics.internal A"]: Refreshing state... [id=Z0613456248X9BR5PAUWH_rancher.comics.internal.app.comics.internal_A]
aws_volume_attachment.isto: Refreshing state... [id=vai-3367550290]
aws_eip.rancher: Refreshing state... [id=eipalloc-0f20552604737825e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.rancher has changed
  ~ resource "aws_eip" "rancher" {
        id                   = "eipalloc-0f20552604737825e"
      + tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_volume_attachment.this[0] has been deleted
  - resource "aws_volume_attachment" "this" {
      - device_name = "/dev/sdh" -> null
      - id          = "vai-2876505751" -> null
      - instance_id = "i-051471ca2e333798e" -> null
      - volume_id   = "vol-096ba94a2417a038f" -> null
    }

  # aws_volume_attachment.this[1] has been deleted
  - resource "aws_volume_attachment" "this" {
      - device_name = "/dev/sdh" -> null
      - id          = "vai-1792568346" -> null
      - instance_id = "i-0f3b50f766112339e" -> null
      - volume_id   = "vol-0aef6998d35835dd8" -> null
    }

  # aws_volume_attachment.this[2] has been deleted
  - resource "aws_volume_attachment" "this" {
      - device_name = "/dev/sdh" -> null
      - id          = "vai-3051708014" -> null
      - instance_id = "i-0d3560b289d1342f9" -> null
      - volume_id   = "vol-0eab6b2eb47d66fb4" -> null
    }

  # module.k8s_instance[0].aws_instance.this[0] has been deleted
  - resource "aws_instance" "this" {
      - ami                                  = "ami-022a1793010cfbc20" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:899903244877:instance/i-051471ca2e333798e" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-051471ca2e333798e" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "stopped" -> null
      - instance_type                        = "t3a.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "comics" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0eb727f30a36e5f1e" -> null
      - private_dns                          = "ip-10-0-101-55.ec2.internal" -> null
      - private_ip                           = "10.0.101.55" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0e3e512cc196dc9cd" -> null
      - tags                                 = {
          - "Environment" = "dev"
          - "Name"        = "k8s"
          - "Project"     = "comics"
          - "Terraform"   = "true"
        } -> null
      - tags_all                             = {
          - "Environment" = "dev"
          - "Name"        = "k8s"
          - "Project"     = "comics"
          - "Terraform"   = "true"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_base64                     = "IyEvYmluL2Jhc2gKeXVtIGluc3RhbGwgZG9ja2VyIC15Ci9ldGMvaW5pdC5kL2RvY2tlciBzdGFydApkb2NrZXIgcnVuIC1kIC0tbmFtZSByYW5jaGVyIC0tcmVzdGFydD11bmxlc3Mtc3RvcHBlZCAtdiAvb3B0L3JhbmNoZXI6L3Zhci9saWIvcmFuY2hlciAgLXAgODA6ODAgLXAgNDQzOjQ0MyByYW5jaGVyL3JhbmNoZXI6djIuNC4zCg==" -> null
      - volume_tags                          = {
          - "Name" = "k8s"
        } -> null
      - vpc_security_group_ids               = [
          - "sg-091e42ffb05cdce5c",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdh" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-096ba94a2417a038f" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e3f574edc605d01b" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp2" -> null
        }

      - timeouts {}
    }

  # module.k8s_instance[1].aws_instance.this[0] has been deleted
  - resource "aws_instance" "this" {
      - ami                                  = "ami-022a1793010cfbc20" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:899903244877:instance/i-0f3b50f766112339e" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0f3b50f766112339e" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "stopped" -> null
      - instance_type                        = "t3a.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "comics" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-04f30afe370859b90" -> null
      - private_dns                          = "ip-10-0-101-115.ec2.internal" -> null
      - private_ip                           = "10.0.101.115" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0e3e512cc196dc9cd" -> null
      - tags                                 = {
          - "Environment" = "dev"
          - "Name"        = "k8s"
          - "Project"     = "comics"
          - "Terraform"   = "true"
        } -> null
      - tags_all                             = {
          - "Environment" = "dev"
          - "Name"        = "k8s"
          - "Project"     = "comics"
          - "Terraform"   = "true"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_base64                     = "IyEvYmluL2Jhc2gKeXVtIGluc3RhbGwgZG9ja2VyIC15Ci9ldGMvaW5pdC5kL2RvY2tlciBzdGFydApkb2NrZXIgcnVuIC1kIC0tbmFtZSByYW5jaGVyIC0tcmVzdGFydD11bmxlc3Mtc3RvcHBlZCAtdiAvb3B0L3JhbmNoZXI6L3Zhci9saWIvcmFuY2hlciAgLXAgODA6ODAgLXAgNDQzOjQ0MyByYW5jaGVyL3JhbmNoZXI6djIuNC4zCg==" -> null
      - volume_tags                          = {
          - "Name" = "k8s"
        } -> null
      - vpc_security_group_ids               = [
          - "sg-091e42ffb05cdce5c",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdh" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0aef6998d35835dd8" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0fc3b3ce7e9fc75a7" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp2" -> null
        }

      - timeouts {}
    }

  # module.k8s_instance[2].aws_instance.this[0] has been deleted
  - resource "aws_instance" "this" {
      - ami                                  = "ami-022a1793010cfbc20" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:899903244877:instance/i-0d3560b289d1342f9" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0d3560b289d1342f9" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "stopped" -> null
      - instance_type                        = "t3a.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "comics" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-03aeafa2fc736e864" -> null
      - private_dns                          = "ip-10-0-101-251.ec2.internal" -> null
      - private_ip                           = "10.0.101.251" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0e3e512cc196dc9cd" -> null
      - tags                                 = {
          - "Environment" = "dev"
          - "Name"        = "k8s"
          - "Project"     = "comics"
          - "Terraform"   = "true"
        } -> null
      - tags_all                             = {
          - "Environment" = "dev"
          - "Name"        = "k8s"
          - "Project"     = "comics"
          - "Terraform"   = "true"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_base64                     = "IyEvYmluL2Jhc2gKeXVtIGluc3RhbGwgZG9ja2VyIC15Ci9ldGMvaW5pdC5kL2RvY2tlciBzdGFydApkb2NrZXIgcnVuIC1kIC0tbmFtZSByYW5jaGVyIC0tcmVzdGFydD11bmxlc3Mtc3RvcHBlZCAtdiAvb3B0L3JhbmNoZXI6L3Zhci9saWIvcmFuY2hlciAgLXAgODA6ODAgLXAgNDQzOjQ0MyByYW5jaGVyL3JhbmNoZXI6djIuNC4zCg==" -> null
      - volume_tags                          = {
          - "Name" = "k8s"
        } -> null
      - vpc_security_group_ids               = [
          - "sg-091e42ffb05cdce5c",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdh" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0eab6b2eb47d66fb4" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-084b827bc463e255b" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp2" -> null
        }

      - timeouts {}
    }

  # module.rancher_instance.aws_instance.this[0] has changed
  ~ resource "aws_instance" "this" {
        id                                   = "i-0a387ecc85e2bc626"
      ~ public_ip                            = "34.239.15.253" -> "52.54.218.220"
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "rancher"
            "Project"     = "comics"
            "Terraform"   = "true"
        }
      ~ volume_tags                          = {
          + "Environment" = "dev"
          + "Project"     = "comics"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
        # (28 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_volume_attachment.this[0] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "/dev/sdh"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = "vol-096ba94a2417a038f"
    }

  # aws_volume_attachment.this[1] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "/dev/sdh"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = "vol-0aef6998d35835dd8"
    }

  # aws_volume_attachment.this[2] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "/dev/sdh"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = "vol-0eab6b2eb47d66fb4"
    }

  # module.k8s_instance[0].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-02c9ebf50ae56530e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "comics"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0e3e512cc196dc9cd"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = "IyEvYmluL2Jhc2gKeXVtIGluc3RhbGwgZG9ja2VyIC15Ci9ldGMvaW5pdC5kL2RvY2tlciBzdGFydApkb2NrZXIgcnVuIC1kIC0tbmFtZSByYW5jaGVyIC0tcmVzdGFydD11bmxlc3Mtc3RvcHBlZCAtdiAvb3B0L3JhbmNoZXI6L3Zhci9saWIvcmFuY2hlciAgLXAgODA6ODAgLXAgNDQzOjQ0MyByYW5jaGVyL3JhbmNoZXI6djIuNC4zCg=="
      + volume_tags                          = {
          + "Name" = "k8s"
        }
      + vpc_security_group_ids               = [
          + "sg-091e42ffb05cdce5c",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.k8s_instance[1].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-02c9ebf50ae56530e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "comics"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0e3e512cc196dc9cd"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = "IyEvYmluL2Jhc2gKeXVtIGluc3RhbGwgZG9ja2VyIC15Ci9ldGMvaW5pdC5kL2RvY2tlciBzdGFydApkb2NrZXIgcnVuIC1kIC0tbmFtZSByYW5jaGVyIC0tcmVzdGFydD11bmxlc3Mtc3RvcHBlZCAtdiAvb3B0L3JhbmNoZXI6L3Zhci9saWIvcmFuY2hlciAgLXAgODA6ODAgLXAgNDQzOjQ0MyByYW5jaGVyL3JhbmNoZXI6djIuNC4zCg=="
      + volume_tags                          = {
          + "Name" = "k8s"
        }
      + vpc_security_group_ids               = [
          + "sg-091e42ffb05cdce5c",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.k8s_instance[2].aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-02c9ebf50ae56530e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "comics"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0e3e512cc196dc9cd"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = "IyEvYmluL2Jhc2gKeXVtIGluc3RhbGwgZG9ja2VyIC15Ci9ldGMvaW5pdC5kL2RvY2tlciBzdGFydApkb2NrZXIgcnVuIC1kIC0tbmFtZSByYW5jaGVyIC0tcmVzdGFydD11bmxlc3Mtc3RvcHBlZCAtdiAvb3B0L3JhbmNoZXI6L3Zhci9saWIvcmFuY2hlciAgLXAgODA6ODAgLXAgNDQzOjQ0MyByYW5jaGVyL3JhbmNoZXI6djIuNC4zCg=="
      + volume_tags                          = {
          + "Name" = "k8s"
        }
      + vpc_security_group_ids               = [
          + "sg-091e42ffb05cdce5c",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.rancher_instance.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0a387ecc85e2bc626"
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "rancher"
            "Project"     = "comics"
            "Terraform"   = "true"
        }
      ~ volume_tags                          = {
          - "Environment" = "dev" -> null
          - "Project"     = "comics" -> null
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (29 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @diogoleal, Action: `pull_request`*